parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
    #define TC1Hhi_BIT8_MASK            1
    #define TC1Hhi_BIT9_MASK            2
    #define TC1Hhi_BIT10_MASK           4
    #define TC1Hhi_BIT11_MASK           8
    #define TC1Hhi_BIT12_MASK           16
    #define TC1Hhi_BIT13_MASK           32
    #define TC1Hhi_BIT14_MASK           64
    #define TC1Hhi_BIT15_MASK           128
    

    /*** TC1Hlo - Timer Input Capture Holding Registers 1 Low; 0x0000007B ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
      } Bits;
    } TC1HloSTR;
    #define TC1Hlo                      _TC1H.Overlap_STR.TC1HloSTR.Byte
    #define TC1Hlo_BIT0                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT0
    #define TC1Hlo_BIT1                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT1
    #define TC1Hlo_BIT2                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT2
    #define TC1Hlo_BIT3                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT3
    #define TC1Hlo_BIT4                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT4
    #define TC1Hlo_BIT5                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT5
    #define TC1Hlo_BIT6                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT6
    #define TC1Hlo_BIT7                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT7
    
    #define TC1Hlo_BIT0_MASK            1
    #define TC1Hlo_BIT1_MASK            2
    #define TC1Hlo_BIT2_MASK            4
    #define TC1Hlo_BIT3_MASK            8
    #define TC1Hlo_BIT4_MASK            16
    #define TC1Hlo_BIT5_MASK            32
    #define TC1Hlo_BIT6_MASK            64
    #define TC1Hlo_BIT7_MASK            128
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
    word BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
    word BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
    word BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
    word BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
    word BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
    word BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
    word BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
    word BIT8        :1;                                       /* Timer Input Capture Holding Bit 8 */
    word BIT9        :1;                                       /* Timer Input Capture Holding Bit 9 */
    word BIT10       :1;                                       /* Timer Input Capture Holding Bit 10 */
    word BIT11       :1;                                       /* Timer Input Capture Holding Bit 11 */
    word BIT12       :1;                                       /* Timer Input Capture Holding Bit 12 */
    word BIT13       :1;                                       /* Timer Input Capture Holding Bit 13 */
    word BIT14       :1;                                       /* Timer Input Capture Holding Bit 14 */
    word BIT15       :1;                                       /* Timer Input Capture Holding Bit 15 */
  } Bits;
} TC1HSTR;
extern volatile TC1HSTR _TC1H @(REG_BASE + 0x0000007A);
#define TC1H                            _TC1H.Word
#define TC1H_BIT0                       _TC1H.Bits.BIT0
#define TC1H_BIT1                       _TC1H.Bits.BIT1
#define TC1H_BIT2                       _TC1H.Bits.BIT2
#define TC1H_BIT3                       _TC1H.Bits.BIT3
#define TC1H_BIT4                       _TC1H.Bits.BIT4
#define TC1H_BIT5                       _TC1H.Bits.BIT5
#define TC1H_BIT6                       _TC1H.Bits.BIT6
#define TC1H_BIT7                       _TC1H.Bits.BIT7
#define TC1H_BIT8                       _TC1H.Bits.BIT8
#define TC1H_BIT9                       _TC1H.Bits.BIT9
#define TC1H_BIT10                      _TC1H.Bits.BIT10
#define TC1H_BIT11                      _TC1H.Bits.BIT11
#define TC1H_BIT12                      _TC1H.Bits.BIT12
#define TC1H_BIT13                      _TC1H.Bits.BIT13
#define TC1H_BIT14                      _TC1H.Bits.BIT14
#define TC1H_BIT15                      _TC1H.Bits.BIT15

#define TC1H_BIT0_MASK                  1
#define TC1H_BIT1_MASK                  2
#define TC1H_BIT2_MASK                  4
#define TC1H_BIT3_MASK                  8
#define TC1H_BIT4_MASK                  16
#define TC1H_BIT5_MASK                  32
#define TC1H_BIT6_MASK                  64
#define TC1H_BIT7_MASK                  128
#define TC1H_BIT8_MASK                  256
#define TC1H_BIT9_MASK                  512
#define TC1H_BIT10_MASK                 1024
#define TC1H_BIT11_MASK                 2048
#define TC1H_BIT12_MASK                 4096
#define TC1H_BIT13_MASK                 8192
#define TC1H_BIT14_MASK                 16384
#define TC1H_BIT15_MASK                 32768


/*** TC2H - Timer Input Capture Holding Registers 2; 0x0000007C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TC2Hhi - Timer Input Capture Holding Registers 2 High; 0x0000007C ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Input Capture Holding Bit 8 */
        byte BIT9        :1;                                       /* Timer Input Capture Holding Bit 9 */
        byte BIT10       :1;                                       /* Timer Input Capture Holding Bit 10 */
        byte BIT11       :1;                                       /* Timer Input Capture Holding Bit 11 */
        byte BIT12       :1;                                       /* Timer Input Capture Holding Bit 12 */
        byte BIT13       :1;                                       /* Timer Input Capture Holding Bit 13 */
        byte BIT14       :1;                                       /* Timer Input Capture Holding Bit 14 */
        byte BIT15       :1;                                       /* Timer Input Capture Holding Bit 15 */
      } Bits;
    } TC2HhiSTR;
    #define TC2Hhi                      _TC2H.Overlap_STR.TC2HhiSTR.Byte
    #define TC2Hhi_BIT8                 _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT8
    #define TC2Hhi_BIT9                 _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT9
    #define TC2Hhi_BIT10                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT10
    #define TC2Hhi_BIT11                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT11
    #define TC2Hhi_BIT12                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT12
    #define TC2Hhi_BIT13                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT13
    #define TC2Hhi_BIT14                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT14
    #define TC2Hhi_BIT15                _TC2H.Overlap_STR.TC2HhiSTR.Bits.BIT15
    
    #define TC2Hhi_BIT8_MASK            1
    #define TC2Hhi_BIT9_MASK            2
    #define TC2Hhi_BIT10_MASK           4
    #define TC2Hhi_BIT11_MASK           8
    #define TC2Hhi_BIT12_MASK           16
    #define TC2Hhi_BIT13_MASK           32
    #define TC2Hhi_BIT14_MASK           64
    #define TC2Hhi_BIT15_MASK           128
    

    /*** TC2Hlo - Timer Input Capture Holding Registers 2 Low; 0x0000007D ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
      } Bits;
    } TC2HloSTR;
    #define TC2Hlo                      _TC2H.Overlap_STR.TC2HloSTR.Byte
    #define TC2Hlo_BIT0                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT0
    #define TC2Hlo_BIT1                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT1
    #define TC2Hlo_BIT2                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT2
    #define TC2Hlo_BIT3                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT3
    #define TC2Hlo_BIT4                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT4
    #define TC2Hlo_BIT5                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT5
    #define TC2Hlo_BIT6                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT6
    #define TC2Hlo_BIT7                 _TC2H.Overlap_STR.TC2HloSTR.Bits.BIT7
    
    #define TC2Hlo_BIT0_MASK            1
    #define TC2Hlo_BIT1_MASK            2
    #define TC2Hlo_BIT2_MASK            4
    #define TC2Hlo_BIT3_MASK            8
    #define TC2Hlo_BIT4_MASK            16
    #define TC2Hlo_BIT5_MASK            32
    #define TC2Hlo_BIT6_MASK            64
    #define TC2Hlo_BIT7_MASK            128
    
  } Overlap_STR;

