parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
#define DLCBCR1_WCM_MASK                1
#define DLCBCR1_IE_MASK                 2
#define DLCBCR1_CLKS_MASK               64
#define DLCBCR1_IMSG_MASK               128


/*** DLCBSVR - BDLC State Vector Register; 0x000000E9 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte I0          :1;                                       /* Interrupt State Vector Bit 0 */
    byte I1          :1;                                       /* Interrupt State Vector Bit 1 */
    byte I2          :1;                                       /* Interrupt State Vector Bit 2 */
    byte I3          :1;                                       /* Interrupt State Vector Bit 3 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpI    :4;
    byte         :1;
    byte         :1;
  } MergedBits;
} DLCBSVRSTR;
extern volatile DLCBSVRSTR _DLCBSVR @(REG_BASE + 0x000000E9);
#define DLCBSVR                         _DLCBSVR.Byte
#define DLCBSVR_I0                      _DLCBSVR.Bits.I0
#define DLCBSVR_I1                      _DLCBSVR.Bits.I1
#define DLCBSVR_I2                      _DLCBSVR.Bits.I2
#define DLCBSVR_I3                      _DLCBSVR.Bits.I3
#define DLCBSVR_I                       _DLCBSVR.MergedBits.grpI

#define DLCBSVR_I0_MASK                 4
#define DLCBSVR_I1_MASK                 8
#define DLCBSVR_I2_MASK                 16
#define DLCBSVR_I3_MASK                 32
#define DLCBSVR_I_MASK                  60
#define DLCBSVR_I_BITNUM                2


/*** DLCBCR2 - BDLC Control Register 2; 0x000000EA ***/
typedef union {
  byte Byte;
  struct {
    byte TMIFR0      :1;                                       /* Transmit In-Frame Response Control 0 */
    byte TMIFR1      :1;                                       /* Transmit In-Frame Response Control 1 */
    byte TSIFR       :1;                                       /* Transmit In-Frame Response Control 2 */
    byte TEOD        :1;                                       /* Transmit End of Data */
    byte NBFS        :1;                                       /* Normalization Bit Format Select */
    byte RX4XE       :1;                                       /* Receive 4X Enable */
    byte DLOOP       :1;                                       /* Digital Loopback Mode */
    byte SMRST       :1;                                       /* State Machine Reset */
  } Bits;
  struct {
    byte grpTMIFR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DLCBCR2STR;
extern volatile DLCBCR2STR _DLCBCR2 @(REG_BASE + 0x000000EA);
#define DLCBCR2                         _DLCBCR2.Byte
#define DLCBCR2_TMIFR0                  _DLCBCR2.Bits.TMIFR0
#define DLCBCR2_TMIFR1                  _DLCBCR2.Bits.TMIFR1
#define DLCBCR2_TSIFR                   _DLCBCR2.Bits.TSIFR
#define DLCBCR2_TEOD                    _DLCBCR2.Bits.TEOD
#define DLCBCR2_NBFS                    _DLCBCR2.Bits.NBFS
#define DLCBCR2_RX4XE                   _DLCBCR2.Bits.RX4XE
#define DLCBCR2_DLOOP                   _DLCBCR2.Bits.DLOOP
#define DLCBCR2_SMRST                   _DLCBCR2.Bits.SMRST
#define DLCBCR2_TMIFR                   _DLCBCR2.MergedBits.grpTMIFR

#define DLCBCR2_TMIFR0_MASK             1
#define DLCBCR2_TMIFR1_MASK             2
#define DLCBCR2_TSIFR_MASK              4
#define DLCBCR2_TEOD_MASK               8
#define DLCBCR2_NBFS_MASK               16
#define DLCBCR2_RX4XE_MASK              32
#define DLCBCR2_DLOOP_MASK              64
#define DLCBCR2_SMRST_MASK              128
#define DLCBCR2_TMIFR_MASK              3
#define DLCBCR2_TMIFR_BITNUM            0


/*** DLCBDR - BDLC Data Register; 0x000000EB ***/
typedef union {
  byte Byte;
  struct {
    byte D0          :1;                                       /* Receive/Transmit Data Bit 0 */
    byte D1          :1;                                       /* Receive/Transmit Data Bit 1 */
    byte D2          :1;                                       /* Receive/Transmit Data Bit 2 */
    byte D3          :1;                                       /* Receive/Transmit Data Bit 3 */
    byte D4          :1;                                       /* Receive/Transmit Data Bit 4 */
    byte D5          :1;                                       /* Receive/Transmit Data Bit 5 */
    byte D6          :1;                                       /* Receive/Transmit Data Bit 6 */
    byte D7          :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} DLCBDRSTR;
extern volatile DLCBDRSTR _DLCBDR @(REG_BASE + 0x000000EB);
#define DLCBDR                          _DLCBDR.Byte
#define DLCBDR_D0                       _DLCBDR.Bits.D0
#define DLCBDR_D1                       _DLCBDR.Bits.D1
#define DLCBDR_D2                       _DLCBDR.Bits.D2
#define DLCBDR_D3                       _DLCBDR.Bits.D3
#define DLCBDR_D4                       _DLCBDR.Bits.D4
#define DLCBDR_D5                       _DLCBDR.Bits.D5
#define DLCBDR_D6                       _DLCBDR.Bits.D6
#define DLCBDR_D7                       _DLCBDR.Bits.D7

#define DLCBDR_D0_MASK                  1
#define DLCBDR_D1_MASK                  2
#define DLCBDR_D2_MASK                  4
#define DLCBDR_D3_MASK                  8
#define DLCBDR_D4_MASK                  16
#define DLCBDR_D5_MASK                  32
#define DLCBDR_D6_MASK                  64
#define DLCBDR_D7_MASK                  128


/*** DLCBARD - BDLC Analog Round Trip Delay Register; 0x000000EC ***/
typedef union {
  byte Byte;
  struct {
    byte BO0         :1;                                       /* BDLC Analog Roundtrip Delay Offset Field 0 */
    byte BO1         :1;                                       /* BDLC Analog Roundtrip Delay Offset Field 1 */
    byte BO2         :1;                                       /* BDLC Analog Roundtrip Delay Offset Field 2 */
    byte BO3         :1;                                       /* BDLC Analog Roundtrip Delay Offset Field 3 */
    byte             :1; 
    byte             :1; 
    byte RXPOL       :1;                                       /* Receive Pin Polarity */
    byte             :1; 
  } Bits;
  struct {
    byte grpBO   :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DLCBARDSTR;
extern volatile DLCBARDSTR _DLCBARD @(REG_BASE + 0x000000EC);
#define DLCBARD                         _DLCBARD.Byte
#define DLCBARD_BO0                     _DLCBARD.Bits.BO0
#define DLCBARD_BO1                     _DLCBARD.Bits.BO1
#define DLCBARD_BO2                     _DLCBARD.Bits.BO2
#define DLCBARD_BO3                     _DLCBARD.Bits.BO3
#define DLCBARD_RXPOL                   _DLCBARD.Bits.RXPOL
#define DLCBARD_BO                      _DLCBARD.MergedBits.grpBO

#define DLCBARD_BO0_MASK                1
#define DLCBARD_BO1_MASK                2
#define DLCBARD_BO2_MASK                4
#define DLCBARD_BO3_MASK                8
#define DLCBARD_RXPOL_MASK              64
#define DLCBARD_BO_MASK                 15
#define DLCBARD_BO_BITNUM               0


/*** DLCBRSR - BDLC Rate Select Register; 0x000000ED ***/
typedef union {
  byte Byte;
  struct {
    byte R0          :1;                                       /* Rate Select 0 */
    byte R1          :1;                                       /* Rate Select 1 */
    byte R2          :1;                                       /* Rate Select 2 */
    byte R3          :1;                                       /* Rate Select 3 */
    byte R4          :1;                                       /* Rate Select 4 */
    byte R5          :1;                                       /* Rate Select 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpR    :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} DLCBRSRSTR;
extern volatile DLCBRSRSTR _DLCBRSR @(REG_BASE + 0x000000ED);
#define DLCBRSR                         _DLCBRSR.Byte
#define DLCBRSR_R0                      _DLCBRSR.Bits.R0
#define DLCBRSR_R1                      _DLCBRSR.Bits.R1
#define DLCBRSR_R2                      _DLCBRSR.Bits.R2
#define DLCBRSR_R3                      _DLCBRSR.Bits.R3
#define DLCBRSR_R4                      _DLCBRSR.Bits.R4
#define DLCBRSR_R5                      _DLCBRSR.Bits.R5
#define DLCBRSR_R                       _DLCBRSR.MergedBits.grpR

#define DLCBRSR_R0_MASK                 1
#define DLCBRSR_R1_MASK                 2
#define DLCBRSR_R2_MASK                 4
#define DLCBRSR_R3_MASK                 8
#define DLCBRSR_R4_MASK                 16
#define DLCBRSR_R5_MASK                 32
#define DLCBRSR_R_MASK                  63
#define DLCBRSR_R_BITNUM                0


