parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
/*** CAN2BTR0 - MSCAN 2 Bus Timing Register 0; 0x000001C2 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN2BTR0STR;
extern volatile CAN2BTR0STR _CAN2BTR0 @(REG_BASE + 0x000001C2);
#define CAN2BTR0                        _CAN2BTR0.Byte
#define CAN2BTR0_BRP0                   _CAN2BTR0.Bits.BRP0
#define CAN2BTR0_BRP1                   _CAN2BTR0.Bits.BRP1
#define CAN2BTR0_BRP2                   _CAN2BTR0.Bits.BRP2
#define CAN2BTR0_BRP3                   _CAN2BTR0.Bits.BRP3
#define CAN2BTR0_BRP4                   _CAN2BTR0.Bits.BRP4
#define CAN2BTR0_BRP5                   _CAN2BTR0.Bits.BRP5
#define CAN2BTR0_SJW0                   _CAN2BTR0.Bits.SJW0
#define CAN2BTR0_SJW1                   _CAN2BTR0.Bits.SJW1
/* CAN2BTR_ARR: Access 2 CAN2BTRx registers in an array */
#define CAN2BTR_ARR                     ((volatile byte *) &CAN2BTR0)
#define CAN2BTR0_BRP                    _CAN2BTR0.MergedBits.grpBRP
#define CAN2BTR0_SJW                    _CAN2BTR0.MergedBits.grpSJW

#define CAN2BTR0_BRP0_MASK              1
#define CAN2BTR0_BRP1_MASK              2
#define CAN2BTR0_BRP2_MASK              4
#define CAN2BTR0_BRP3_MASK              8
#define CAN2BTR0_BRP4_MASK              16
#define CAN2BTR0_BRP5_MASK              32
#define CAN2BTR0_SJW0_MASK              64
#define CAN2BTR0_SJW1_MASK              128
#define CAN2BTR0_BRP_MASK               63
#define CAN2BTR0_BRP_BITNUM             0
#define CAN2BTR0_SJW_MASK               192
#define CAN2BTR0_SJW_BITNUM             6


/*** CAN2BTR1 - MSCAN 2 Bus Timing Register 1; 0x000001C3 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN2BTR1STR;
extern volatile CAN2BTR1STR _CAN2BTR1 @(REG_BASE + 0x000001C3);
#define CAN2BTR1                        _CAN2BTR1.Byte
#define CAN2BTR1_TSEG10                 _CAN2BTR1.Bits.TSEG10
#define CAN2BTR1_TSEG11                 _CAN2BTR1.Bits.TSEG11
#define CAN2BTR1_TSEG12                 _CAN2BTR1.Bits.TSEG12
#define CAN2BTR1_TSEG13                 _CAN2BTR1.Bits.TSEG13
#define CAN2BTR1_TSEG20                 _CAN2BTR1.Bits.TSEG20
#define CAN2BTR1_TSEG21                 _CAN2BTR1.Bits.TSEG21
#define CAN2BTR1_TSEG22                 _CAN2BTR1.Bits.TSEG22
#define CAN2BTR1_SAMP                   _CAN2BTR1.Bits.SAMP
#define CAN2BTR1_TSEG_10                _CAN2BTR1.MergedBits.grpTSEG_10
#define CAN2BTR1_TSEG_20                _CAN2BTR1.MergedBits.grpTSEG_20
#define CAN2BTR1_TSEG                   CAN2BTR1_TSEG_10

#define CAN2BTR1_TSEG10_MASK            1
#define CAN2BTR1_TSEG11_MASK            2
#define CAN2BTR1_TSEG12_MASK            4
#define CAN2BTR1_TSEG13_MASK            8
#define CAN2BTR1_TSEG20_MASK            16
#define CAN2BTR1_TSEG21_MASK            32
#define CAN2BTR1_TSEG22_MASK            64
#define CAN2BTR1_SAMP_MASK              128
#define CAN2BTR1_TSEG_10_MASK           15
#define CAN2BTR1_TSEG_10_BITNUM         0
#define CAN2BTR1_TSEG_20_MASK           112
#define CAN2BTR1_TSEG_20_BITNUM         4


/*** CAN2RFLG - MSCAN 2 Receiver Flag Register; 0x000001C4 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RFLGSTR;
extern volatile CAN2RFLGSTR _CAN2RFLG @(REG_BASE + 0x000001C4);
#define CAN2RFLG                        _CAN2RFLG.Byte
#define CAN2RFLG_RXF                    _CAN2RFLG.Bits.RXF
#define CAN2RFLG_OVRIF                  _CAN2RFLG.Bits.OVRIF
#define CAN2RFLG_TSTAT0                 _CAN2RFLG.Bits.TSTAT0
#define CAN2RFLG_TSTAT1                 _CAN2RFLG.Bits.TSTAT1
#define CAN2RFLG_RSTAT0                 _CAN2RFLG.Bits.RSTAT0
#define CAN2RFLG_RSTAT1                 _CAN2RFLG.Bits.RSTAT1
#define CAN2RFLG_CSCIF                  _CAN2RFLG.Bits.CSCIF
#define CAN2RFLG_WUPIF                  _CAN2RFLG.Bits.WUPIF
#define CAN2RFLG_TSTAT                  _CAN2RFLG.MergedBits.grpTSTAT
#define CAN2RFLG_RSTAT                  _CAN2RFLG.MergedBits.grpRSTAT

