parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
extern volatile CAN2TAAKSTR _CAN2TAAK @(REG_BASE + 0x000001C9);
#define CAN2TAAK                        _CAN2TAAK.Byte
#define CAN2TAAK_ABTAK0                 _CAN2TAAK.Bits.ABTAK0
#define CAN2TAAK_ABTAK1                 _CAN2TAAK.Bits.ABTAK1
#define CAN2TAAK_ABTAK2                 _CAN2TAAK.Bits.ABTAK2
#define CAN2TAAK_ABTAK                  _CAN2TAAK.MergedBits.grpABTAK

#define CAN2TAAK_ABTAK0_MASK            1
#define CAN2TAAK_ABTAK1_MASK            2
#define CAN2TAAK_ABTAK2_MASK            4
#define CAN2TAAK_ABTAK_MASK             7
#define CAN2TAAK_ABTAK_BITNUM           0


/*** CAN2TBSEL - MSCAN 2 Transmit Buffer Selection; 0x000001CA ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TBSELSTR;
extern volatile CAN2TBSELSTR _CAN2TBSEL @(REG_BASE + 0x000001CA);
#define CAN2TBSEL                       _CAN2TBSEL.Byte
#define CAN2TBSEL_TX0                   _CAN2TBSEL.Bits.TX0
#define CAN2TBSEL_TX1                   _CAN2TBSEL.Bits.TX1
#define CAN2TBSEL_TX2                   _CAN2TBSEL.Bits.TX2
#define CAN2TBSEL_TX                    _CAN2TBSEL.MergedBits.grpTX

#define CAN2TBSEL_TX0_MASK              1
#define CAN2TBSEL_TX1_MASK              2
#define CAN2TBSEL_TX2_MASK              4
#define CAN2TBSEL_TX_MASK               7
#define CAN2TBSEL_TX_BITNUM             0


/*** CAN2IDAC - MSCAN 2 Identifier Acceptance Control Register; 0x000001CB ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2IDACSTR;
extern volatile CAN2IDACSTR _CAN2IDAC @(REG_BASE + 0x000001CB);
#define CAN2IDAC                        _CAN2IDAC.Byte
#define CAN2IDAC_IDHIT0                 _CAN2IDAC.Bits.IDHIT0
#define CAN2IDAC_IDHIT1                 _CAN2IDAC.Bits.IDHIT1
#define CAN2IDAC_IDHIT2                 _CAN2IDAC.Bits.IDHIT2
#define CAN2IDAC_IDAM0                  _CAN2IDAC.Bits.IDAM0
#define CAN2IDAC_IDAM1                  _CAN2IDAC.Bits.IDAM1
#define CAN2IDAC_IDHIT                  _CAN2IDAC.MergedBits.grpIDHIT
#define CAN2IDAC_IDAM                   _CAN2IDAC.MergedBits.grpIDAM

#define CAN2IDAC_IDHIT0_MASK            1
#define CAN2IDAC_IDHIT1_MASK            2
#define CAN2IDAC_IDHIT2_MASK            4
#define CAN2IDAC_IDAM0_MASK             16
#define CAN2IDAC_IDAM1_MASK             32
#define CAN2IDAC_IDHIT_MASK             7
#define CAN2IDAC_IDHIT_BITNUM           0
#define CAN2IDAC_IDAM_MASK              48
#define CAN2IDAC_IDAM_BITNUM            4


/*** CAN2RXERR - MSCAN 2 Receive Error Counter Register; 0x000001CE ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN2RXERRSTR;
extern volatile CAN2RXERRSTR _CAN2RXERR @(REG_BASE + 0x000001CE);
#define CAN2RXERR                       _CAN2RXERR.Byte
#define CAN2RXERR_RXERR0                _CAN2RXERR.Bits.RXERR0
#define CAN2RXERR_RXERR1                _CAN2RXERR.Bits.RXERR1
#define CAN2RXERR_RXERR2                _CAN2RXERR.Bits.RXERR2
#define CAN2RXERR_RXERR3                _CAN2RXERR.Bits.RXERR3
#define CAN2RXERR_RXERR4                _CAN2RXERR.Bits.RXERR4
#define CAN2RXERR_RXERR5                _CAN2RXERR.Bits.RXERR5
#define CAN2RXERR_RXERR6                _CAN2RXERR.Bits.RXERR6
#define CAN2RXERR_RXERR7                _CAN2RXERR.Bits.RXERR7

#define CAN2RXERR_RXERR0_MASK           1
#define CAN2RXERR_RXERR1_MASK           2
#define CAN2RXERR_RXERR2_MASK           4
#define CAN2RXERR_RXERR3_MASK           8
#define CAN2RXERR_RXERR4_MASK           16
#define CAN2RXERR_RXERR5_MASK           32
#define CAN2RXERR_RXERR6_MASK           64
#define CAN2RXERR_RXERR7_MASK           128


/*** CAN2TXERR - MSCAN 2 Transmit Error Counter Register; 0x000001CF ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN2TXERRSTR;
extern volatile CAN2TXERRSTR _CAN2TXERR @(REG_BASE + 0x000001CF);
#define CAN2TXERR                       _CAN2TXERR.Byte
#define CAN2TXERR_TXERR0                _CAN2TXERR.Bits.TXERR0
#define CAN2TXERR_TXERR1                _CAN2TXERR.Bits.TXERR1
#define CAN2TXERR_TXERR2                _CAN2TXERR.Bits.TXERR2
#define CAN2TXERR_TXERR3                _CAN2TXERR.Bits.TXERR3
#define CAN2TXERR_TXERR4                _CAN2TXERR.Bits.TXERR4
#define CAN2TXERR_TXERR5                _CAN2TXERR.Bits.TXERR5
#define CAN2TXERR_TXERR6                _CAN2TXERR.Bits.TXERR6
#define CAN2TXERR_TXERR7                _CAN2TXERR.Bits.TXERR7

#define CAN2TXERR_TXERR0_MASK           1
#define CAN2TXERR_TXERR1_MASK           2
#define CAN2TXERR_TXERR2_MASK           4
#define CAN2TXERR_TXERR3_MASK           8
#define CAN2TXERR_TXERR4_MASK           16
#define CAN2TXERR_TXERR5_MASK           32
#define CAN2TXERR_TXERR6_MASK           64
#define CAN2TXERR_TXERR7_MASK           128


/*** CAN2IDAR0 - MSCAN 2 Identifier Acceptance Register 0; 0x000001D0 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR0STR;
extern volatile CAN2IDAR0STR _CAN2IDAR0 @(REG_BASE + 0x000001D0);
#define CAN2IDAR0                       _CAN2IDAR0.Byte
#define CAN2IDAR0_AC0                   _CAN2IDAR0.Bits.AC0
#define CAN2IDAR0_AC1                   _CAN2IDAR0.Bits.AC1
#define CAN2IDAR0_AC2                   _CAN2IDAR0.Bits.AC2
#define CAN2IDAR0_AC3                   _CAN2IDAR0.Bits.AC3
#define CAN2IDAR0_AC4                   _CAN2IDAR0.Bits.AC4
#define CAN2IDAR0_AC5                   _CAN2IDAR0.Bits.AC5
#define CAN2IDAR0_AC6                   _CAN2IDAR0.Bits.AC6
#define CAN2IDAR0_AC7                   _CAN2IDAR0.Bits.AC7
/* CAN2IDAR_ARR: Access 4 CAN2IDARx registers in an array */
#define CAN2IDAR_ARR                    ((volatile byte *) &CAN2IDAR0)

#define CAN2IDAR0_AC0_MASK              1
#define CAN2IDAR0_AC1_MASK              2
#define CAN2IDAR0_AC2_MASK              4
#define CAN2IDAR0_AC3_MASK              8
#define CAN2IDAR0_AC4_MASK              16
#define CAN2IDAR0_AC5_MASK              32
#define CAN2IDAR0_AC6_MASK              64
#define CAN2IDAR0_AC7_MASK              128


