parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
/*** CAN2RXDSR3 - MSCAN 2 Receive Data Segment Register 3; 0x000001E7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR3STR;
extern volatile CAN2RXDSR3STR _CAN2RXDSR3 @(REG_BASE + 0x000001E7);
#define CAN2RXDSR3                      _CAN2RXDSR3.Byte
#define CAN2RXDSR3_DB0                  _CAN2RXDSR3.Bits.DB0
#define CAN2RXDSR3_DB1                  _CAN2RXDSR3.Bits.DB1
#define CAN2RXDSR3_DB2                  _CAN2RXDSR3.Bits.DB2
#define CAN2RXDSR3_DB3                  _CAN2RXDSR3.Bits.DB3
#define CAN2RXDSR3_DB4                  _CAN2RXDSR3.Bits.DB4
#define CAN2RXDSR3_DB5                  _CAN2RXDSR3.Bits.DB5
#define CAN2RXDSR3_DB6                  _CAN2RXDSR3.Bits.DB6
#define CAN2RXDSR3_DB7                  _CAN2RXDSR3.Bits.DB7

#define CAN2RXDSR3_DB0_MASK             1
#define CAN2RXDSR3_DB1_MASK             2
#define CAN2RXDSR3_DB2_MASK             4
#define CAN2RXDSR3_DB3_MASK             8
#define CAN2RXDSR3_DB4_MASK             16
#define CAN2RXDSR3_DB5_MASK             32
#define CAN2RXDSR3_DB6_MASK             64
#define CAN2RXDSR3_DB7_MASK             128


/*** CAN2RXDSR4 - MSCAN 2 Receive Data Segment Register 4; 0x000001E8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR4STR;
extern volatile CAN2RXDSR4STR _CAN2RXDSR4 @(REG_BASE + 0x000001E8);
#define CAN2RXDSR4                      _CAN2RXDSR4.Byte
#define CAN2RXDSR4_DB0                  _CAN2RXDSR4.Bits.DB0
#define CAN2RXDSR4_DB1                  _CAN2RXDSR4.Bits.DB1
#define CAN2RXDSR4_DB2                  _CAN2RXDSR4.Bits.DB2
#define CAN2RXDSR4_DB3                  _CAN2RXDSR4.Bits.DB3
#define CAN2RXDSR4_DB4                  _CAN2RXDSR4.Bits.DB4
#define CAN2RXDSR4_DB5                  _CAN2RXDSR4.Bits.DB5
#define CAN2RXDSR4_DB6                  _CAN2RXDSR4.Bits.DB6
#define CAN2RXDSR4_DB7                  _CAN2RXDSR4.Bits.DB7

#define CAN2RXDSR4_DB0_MASK             1
#define CAN2RXDSR4_DB1_MASK             2
#define CAN2RXDSR4_DB2_MASK             4
#define CAN2RXDSR4_DB3_MASK             8
#define CAN2RXDSR4_DB4_MASK             16
#define CAN2RXDSR4_DB5_MASK             32
#define CAN2RXDSR4_DB6_MASK             64
#define CAN2RXDSR4_DB7_MASK             128


/*** CAN2RXDSR5 - MSCAN 2 Receive Data Segment Register 5; 0x000001E9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR5STR;
extern volatile CAN2RXDSR5STR _CAN2RXDSR5 @(REG_BASE + 0x000001E9);
#define CAN2RXDSR5                      _CAN2RXDSR5.Byte
#define CAN2RXDSR5_DB0                  _CAN2RXDSR5.Bits.DB0
#define CAN2RXDSR5_DB1                  _CAN2RXDSR5.Bits.DB1
#define CAN2RXDSR5_DB2                  _CAN2RXDSR5.Bits.DB2
#define CAN2RXDSR5_DB3                  _CAN2RXDSR5.Bits.DB3
#define CAN2RXDSR5_DB4                  _CAN2RXDSR5.Bits.DB4
#define CAN2RXDSR5_DB5                  _CAN2RXDSR5.Bits.DB5
#define CAN2RXDSR5_DB6                  _CAN2RXDSR5.Bits.DB6
#define CAN2RXDSR5_DB7                  _CAN2RXDSR5.Bits.DB7

#define CAN2RXDSR5_DB0_MASK             1
#define CAN2RXDSR5_DB1_MASK             2
#define CAN2RXDSR5_DB2_MASK             4
#define CAN2RXDSR5_DB3_MASK             8
#define CAN2RXDSR5_DB4_MASK             16
#define CAN2RXDSR5_DB5_MASK             32
#define CAN2RXDSR5_DB6_MASK             64
#define CAN2RXDSR5_DB7_MASK             128


/*** CAN2RXDSR6 - MSCAN 2 Receive Data Segment Register 6; 0x000001EA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR6STR;
extern volatile CAN2RXDSR6STR _CAN2RXDSR6 @(REG_BASE + 0x000001EA);
#define CAN2RXDSR6                      _CAN2RXDSR6.Byte
#define CAN2RXDSR6_DB0                  _CAN2RXDSR6.Bits.DB0
#define CAN2RXDSR6_DB1                  _CAN2RXDSR6.Bits.DB1
#define CAN2RXDSR6_DB2                  _CAN2RXDSR6.Bits.DB2
#define CAN2RXDSR6_DB3                  _CAN2RXDSR6.Bits.DB3
#define CAN2RXDSR6_DB4                  _CAN2RXDSR6.Bits.DB4
#define CAN2RXDSR6_DB5                  _CAN2RXDSR6.Bits.DB5
#define CAN2RXDSR6_DB6                  _CAN2RXDSR6.Bits.DB6
#define CAN2RXDSR6_DB7                  _CAN2RXDSR6.Bits.DB7

#define CAN2RXDSR6_DB0_MASK             1
#define CAN2RXDSR6_DB1_MASK             2
#define CAN2RXDSR6_DB2_MASK             4
#define CAN2RXDSR6_DB3_MASK             8
#define CAN2RXDSR6_DB4_MASK             16
#define CAN2RXDSR6_DB5_MASK             32
#define CAN2RXDSR6_DB6_MASK             64
#define CAN2RXDSR6_DB7_MASK             128


/*** CAN2RXDSR7 - MSCAN 2 Receive Data Segment Register 7; 0x000001EB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR7STR;
extern volatile CAN2RXDSR7STR _CAN2RXDSR7 @(REG_BASE + 0x000001EB);
#define CAN2RXDSR7                      _CAN2RXDSR7.Byte
#define CAN2RXDSR7_DB0                  _CAN2RXDSR7.Bits.DB0
#define CAN2RXDSR7_DB1                  _CAN2RXDSR7.Bits.DB1
#define CAN2RXDSR7_DB2                  _CAN2RXDSR7.Bits.DB2
#define CAN2RXDSR7_DB3                  _CAN2RXDSR7.Bits.DB3
#define CAN2RXDSR7_DB4                  _CAN2RXDSR7.Bits.DB4
#define CAN2RXDSR7_DB5                  _CAN2RXDSR7.Bits.DB5
#define CAN2RXDSR7_DB6                  _CAN2RXDSR7.Bits.DB6
#define CAN2RXDSR7_DB7                  _CAN2RXDSR7.Bits.DB7

#define CAN2RXDSR7_DB0_MASK             1
#define CAN2RXDSR7_DB1_MASK             2
#define CAN2RXDSR7_DB2_MASK             4
#define CAN2RXDSR7_DB3_MASK             8
#define CAN2RXDSR7_DB4_MASK             16
#define CAN2RXDSR7_DB5_MASK             32
#define CAN2RXDSR7_DB6_MASK             64
#define CAN2RXDSR7_DB7_MASK             128


