parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
#define CAN2TXDSR4_DB0_MASK             1
#define CAN2TXDSR4_DB1_MASK             2
#define CAN2TXDSR4_DB2_MASK             4
#define CAN2TXDSR4_DB3_MASK             8
#define CAN2TXDSR4_DB4_MASK             16
#define CAN2TXDSR4_DB5_MASK             32
#define CAN2TXDSR4_DB6_MASK             64
#define CAN2TXDSR4_DB7_MASK             128


/*** CAN2TXDSR5 - MSCAN 2 Transmit Data Segment Register 5; 0x000001F9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR5STR;
extern volatile CAN2TXDSR5STR _CAN2TXDSR5 @(REG_BASE + 0x000001F9);
#define CAN2TXDSR5                      _CAN2TXDSR5.Byte
#define CAN2TXDSR5_DB0                  _CAN2TXDSR5.Bits.DB0
#define CAN2TXDSR5_DB1                  _CAN2TXDSR5.Bits.DB1
#define CAN2TXDSR5_DB2                  _CAN2TXDSR5.Bits.DB2
#define CAN2TXDSR5_DB3                  _CAN2TXDSR5.Bits.DB3
#define CAN2TXDSR5_DB4                  _CAN2TXDSR5.Bits.DB4
#define CAN2TXDSR5_DB5                  _CAN2TXDSR5.Bits.DB5
#define CAN2TXDSR5_DB6                  _CAN2TXDSR5.Bits.DB6
#define CAN2TXDSR5_DB7                  _CAN2TXDSR5.Bits.DB7

#define CAN2TXDSR5_DB0_MASK             1
#define CAN2TXDSR5_DB1_MASK             2
#define CAN2TXDSR5_DB2_MASK             4
#define CAN2TXDSR5_DB3_MASK             8
#define CAN2TXDSR5_DB4_MASK             16
#define CAN2TXDSR5_DB5_MASK             32
#define CAN2TXDSR5_DB6_MASK             64
#define CAN2TXDSR5_DB7_MASK             128


/*** CAN2TXDSR6 - MSCAN 2 Transmit Data Segment Register 6; 0x000001FA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR6STR;
extern volatile CAN2TXDSR6STR _CAN2TXDSR6 @(REG_BASE + 0x000001FA);
#define CAN2TXDSR6                      _CAN2TXDSR6.Byte
#define CAN2TXDSR6_DB0                  _CAN2TXDSR6.Bits.DB0
#define CAN2TXDSR6_DB1                  _CAN2TXDSR6.Bits.DB1
#define CAN2TXDSR6_DB2                  _CAN2TXDSR6.Bits.DB2
#define CAN2TXDSR6_DB3                  _CAN2TXDSR6.Bits.DB3
#define CAN2TXDSR6_DB4                  _CAN2TXDSR6.Bits.DB4
#define CAN2TXDSR6_DB5                  _CAN2TXDSR6.Bits.DB5
#define CAN2TXDSR6_DB6                  _CAN2TXDSR6.Bits.DB6
#define CAN2TXDSR6_DB7                  _CAN2TXDSR6.Bits.DB7

#define CAN2TXDSR6_DB0_MASK             1
#define CAN2TXDSR6_DB1_MASK             2
#define CAN2TXDSR6_DB2_MASK             4
#define CAN2TXDSR6_DB3_MASK             8
#define CAN2TXDSR6_DB4_MASK             16
#define CAN2TXDSR6_DB5_MASK             32
#define CAN2TXDSR6_DB6_MASK             64
#define CAN2TXDSR6_DB7_MASK             128


/*** CAN2TXDSR7 - MSCAN 2 Transmit Data Segment Register 7; 0x000001FB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR7STR;
extern volatile CAN2TXDSR7STR _CAN2TXDSR7 @(REG_BASE + 0x000001FB);
#define CAN2TXDSR7                      _CAN2TXDSR7.Byte
#define CAN2TXDSR7_DB0                  _CAN2TXDSR7.Bits.DB0
#define CAN2TXDSR7_DB1                  _CAN2TXDSR7.Bits.DB1
#define CAN2TXDSR7_DB2                  _CAN2TXDSR7.Bits.DB2
#define CAN2TXDSR7_DB3                  _CAN2TXDSR7.Bits.DB3
#define CAN2TXDSR7_DB4                  _CAN2TXDSR7.Bits.DB4
#define CAN2TXDSR7_DB5                  _CAN2TXDSR7.Bits.DB5
#define CAN2TXDSR7_DB6                  _CAN2TXDSR7.Bits.DB6
#define CAN2TXDSR7_DB7                  _CAN2TXDSR7.Bits.DB7

#define CAN2TXDSR7_DB0_MASK             1
#define CAN2TXDSR7_DB1_MASK             2
#define CAN2TXDSR7_DB2_MASK             4
#define CAN2TXDSR7_DB3_MASK             8
#define CAN2TXDSR7_DB4_MASK             16
#define CAN2TXDSR7_DB5_MASK             32
#define CAN2TXDSR7_DB6_MASK             64
#define CAN2TXDSR7_DB7_MASK             128


/*** CAN2TXDLR - MSCAN 2 Transmit Data Length Register; 0x000001FC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TXDLRSTR;
