parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
extern volatile CAN3TARQSTR _CAN3TARQ @(REG_BASE + 0x00000208);
#define CAN3TARQ                        _CAN3TARQ.Byte
#define CAN3TARQ_ABTRQ0                 _CAN3TARQ.Bits.ABTRQ0
#define CAN3TARQ_ABTRQ1                 _CAN3TARQ.Bits.ABTRQ1
#define CAN3TARQ_ABTRQ2                 _CAN3TARQ.Bits.ABTRQ2
#define CAN3TARQ_ABTRQ                  _CAN3TARQ.MergedBits.grpABTRQ

#define CAN3TARQ_ABTRQ0_MASK            1
#define CAN3TARQ_ABTRQ1_MASK            2
#define CAN3TARQ_ABTRQ2_MASK            4
#define CAN3TARQ_ABTRQ_MASK             7
#define CAN3TARQ_ABTRQ_BITNUM           0


/*** CAN3TAAK - MSCAN 3 Transmitter Message Abort Control; 0x00000209 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TAAKSTR;
extern volatile CAN3TAAKSTR _CAN3TAAK @(REG_BASE + 0x00000209);
#define CAN3TAAK                        _CAN3TAAK.Byte
#define CAN3TAAK_ABTAK0                 _CAN3TAAK.Bits.ABTAK0
#define CAN3TAAK_ABTAK1                 _CAN3TAAK.Bits.ABTAK1
#define CAN3TAAK_ABTAK2                 _CAN3TAAK.Bits.ABTAK2
#define CAN3TAAK_ABTAK                  _CAN3TAAK.MergedBits.grpABTAK

#define CAN3TAAK_ABTAK0_MASK            1
#define CAN3TAAK_ABTAK1_MASK            2
#define CAN3TAAK_ABTAK2_MASK            4
#define CAN3TAAK_ABTAK_MASK             7
#define CAN3TAAK_ABTAK_BITNUM           0


/*** CAN3TBSEL - MSCAN 3 Transmit Buffer Selection; 0x0000020A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TBSELSTR;
extern volatile CAN3TBSELSTR _CAN3TBSEL @(REG_BASE + 0x0000020A);
#define CAN3TBSEL                       _CAN3TBSEL.Byte
#define CAN3TBSEL_TX0                   _CAN3TBSEL.Bits.TX0
#define CAN3TBSEL_TX1                   _CAN3TBSEL.Bits.TX1
#define CAN3TBSEL_TX2                   _CAN3TBSEL.Bits.TX2
#define CAN3TBSEL_TX                    _CAN3TBSEL.MergedBits.grpTX

#define CAN3TBSEL_TX0_MASK              1
#define CAN3TBSEL_TX1_MASK              2
#define CAN3TBSEL_TX2_MASK              4
#define CAN3TBSEL_TX_MASK               7
#define CAN3TBSEL_TX_BITNUM             0


/*** CAN3IDAC - MSCAN 3 Identifier Acceptance Control Register; 0x0000020B ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3IDACSTR;
extern volatile CAN3IDACSTR _CAN3IDAC @(REG_BASE + 0x0000020B);
#define CAN3IDAC                        _CAN3IDAC.Byte
#define CAN3IDAC_IDHIT0                 _CAN3IDAC.Bits.IDHIT0
#define CAN3IDAC_IDHIT1                 _CAN3IDAC.Bits.IDHIT1
#define CAN3IDAC_IDHIT2                 _CAN3IDAC.Bits.IDHIT2
#define CAN3IDAC_IDAM0                  _CAN3IDAC.Bits.IDAM0
#define CAN3IDAC_IDAM1                  _CAN3IDAC.Bits.IDAM1
#define CAN3IDAC_IDHIT                  _CAN3IDAC.MergedBits.grpIDHIT
#define CAN3IDAC_IDAM                   _CAN3IDAC.MergedBits.grpIDAM

#define CAN3IDAC_IDHIT0_MASK            1
#define CAN3IDAC_IDHIT1_MASK            2
#define CAN3IDAC_IDHIT2_MASK            4
#define CAN3IDAC_IDAM0_MASK             16
#define CAN3IDAC_IDAM1_MASK             32
#define CAN3IDAC_IDHIT_MASK             7
#define CAN3IDAC_IDHIT_BITNUM           0
#define CAN3IDAC_IDAM_MASK              48
#define CAN3IDAC_IDAM_BITNUM            4


/*** CAN3RXERR - MSCAN 3 Receive Error Counter Register; 0x0000020E ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN3RXERRSTR;
extern volatile CAN3RXERRSTR _CAN3RXERR @(REG_BASE + 0x0000020E);
#define CAN3RXERR                       _CAN3RXERR.Byte
#define CAN3RXERR_RXERR0                _CAN3RXERR.Bits.RXERR0
#define CAN3RXERR_RXERR1                _CAN3RXERR.Bits.RXERR1
#define CAN3RXERR_RXERR2                _CAN3RXERR.Bits.RXERR2
#define CAN3RXERR_RXERR3                _CAN3RXERR.Bits.RXERR3
#define CAN3RXERR_RXERR4                _CAN3RXERR.Bits.RXERR4
#define CAN3RXERR_RXERR5                _CAN3RXERR.Bits.RXERR5
#define CAN3RXERR_RXERR6                _CAN3RXERR.Bits.RXERR6
#define CAN3RXERR_RXERR7                _CAN3RXERR.Bits.RXERR7

