parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
extern volatile CAN3RXDSR0STR _CAN3RXDSR0 @(REG_BASE + 0x00000224);
#define CAN3RXDSR0                      _CAN3RXDSR0.Byte
#define CAN3RXDSR0_DB0                  _CAN3RXDSR0.Bits.DB0
#define CAN3RXDSR0_DB1                  _CAN3RXDSR0.Bits.DB1
#define CAN3RXDSR0_DB2                  _CAN3RXDSR0.Bits.DB2
#define CAN3RXDSR0_DB3                  _CAN3RXDSR0.Bits.DB3
#define CAN3RXDSR0_DB4                  _CAN3RXDSR0.Bits.DB4
#define CAN3RXDSR0_DB5                  _CAN3RXDSR0.Bits.DB5
#define CAN3RXDSR0_DB6                  _CAN3RXDSR0.Bits.DB6
#define CAN3RXDSR0_DB7                  _CAN3RXDSR0.Bits.DB7
/* CAN3RXDSR_ARR: Access 8 CAN3RXDSRx registers in an array */
#define CAN3RXDSR_ARR                   ((volatile byte *) &CAN3RXDSR0)

#define CAN3RXDSR0_DB0_MASK             1
#define CAN3RXDSR0_DB1_MASK             2
#define CAN3RXDSR0_DB2_MASK             4
#define CAN3RXDSR0_DB3_MASK             8
#define CAN3RXDSR0_DB4_MASK             16
#define CAN3RXDSR0_DB5_MASK             32
#define CAN3RXDSR0_DB6_MASK             64
#define CAN3RXDSR0_DB7_MASK             128


/*** CAN3RXDSR1 - MSCAN 3 Receive Data Segment Register 1; 0x00000225 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR1STR;
extern volatile CAN3RXDSR1STR _CAN3RXDSR1 @(REG_BASE + 0x00000225);
#define CAN3RXDSR1                      _CAN3RXDSR1.Byte
#define CAN3RXDSR1_DB0                  _CAN3RXDSR1.Bits.DB0
#define CAN3RXDSR1_DB1                  _CAN3RXDSR1.Bits.DB1
#define CAN3RXDSR1_DB2                  _CAN3RXDSR1.Bits.DB2
#define CAN3RXDSR1_DB3                  _CAN3RXDSR1.Bits.DB3
#define CAN3RXDSR1_DB4                  _CAN3RXDSR1.Bits.DB4
#define CAN3RXDSR1_DB5                  _CAN3RXDSR1.Bits.DB5
#define CAN3RXDSR1_DB6                  _CAN3RXDSR1.Bits.DB6
#define CAN3RXDSR1_DB7                  _CAN3RXDSR1.Bits.DB7

#define CAN3RXDSR1_DB0_MASK             1
#define CAN3RXDSR1_DB1_MASK             2
#define CAN3RXDSR1_DB2_MASK             4
#define CAN3RXDSR1_DB3_MASK             8
#define CAN3RXDSR1_DB4_MASK             16
#define CAN3RXDSR1_DB5_MASK             32
#define CAN3RXDSR1_DB6_MASK             64
#define CAN3RXDSR1_DB7_MASK             128


/*** CAN3RXDSR2 - MSCAN 3 Receive Data Segment Register 2; 0x00000226 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR2STR;
extern volatile CAN3RXDSR2STR _CAN3RXDSR2 @(REG_BASE + 0x00000226);
#define CAN3RXDSR2                      _CAN3RXDSR2.Byte
#define CAN3RXDSR2_DB0                  _CAN3RXDSR2.Bits.DB0
#define CAN3RXDSR2_DB1                  _CAN3RXDSR2.Bits.DB1
#define CAN3RXDSR2_DB2                  _CAN3RXDSR2.Bits.DB2
#define CAN3RXDSR2_DB3                  _CAN3RXDSR2.Bits.DB3
#define CAN3RXDSR2_DB4                  _CAN3RXDSR2.Bits.DB4
#define CAN3RXDSR2_DB5                  _CAN3RXDSR2.Bits.DB5
#define CAN3RXDSR2_DB6                  _CAN3RXDSR2.Bits.DB6
#define CAN3RXDSR2_DB7                  _CAN3RXDSR2.Bits.DB7

#define CAN3RXDSR2_DB0_MASK             1
#define CAN3RXDSR2_DB1_MASK             2
#define CAN3RXDSR2_DB2_MASK             4
#define CAN3RXDSR2_DB3_MASK             8
#define CAN3RXDSR2_DB4_MASK             16
#define CAN3RXDSR2_DB5_MASK             32
#define CAN3RXDSR2_DB6_MASK             64
#define CAN3RXDSR2_DB7_MASK             128


/*** CAN3RXDSR3 - MSCAN 3 Receive Data Segment Register 3; 0x00000227 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR3STR;
extern volatile CAN3RXDSR3STR _CAN3RXDSR3 @(REG_BASE + 0x00000227);
#define CAN3RXDSR3                      _CAN3RXDSR3.Byte
#define CAN3RXDSR3_DB0                  _CAN3RXDSR3.Bits.DB0
#define CAN3RXDSR3_DB1                  _CAN3RXDSR3.Bits.DB1
#define CAN3RXDSR3_DB2                  _CAN3RXDSR3.Bits.DB2
#define CAN3RXDSR3_DB3                  _CAN3RXDSR3.Bits.DB3
#define CAN3RXDSR3_DB4                  _CAN3RXDSR3.Bits.DB4
#define CAN3RXDSR3_DB5                  _CAN3RXDSR3.Bits.DB5
#define CAN3RXDSR3_DB6                  _CAN3RXDSR3.Bits.DB6
#define CAN3RXDSR3_DB7                  _CAN3RXDSR3.Bits.DB7

#define CAN3RXDSR3_DB0_MASK             1
#define CAN3RXDSR3_DB1_MASK             2
#define CAN3RXDSR3_DB2_MASK             4
#define CAN3RXDSR3_DB3_MASK             8
#define CAN3RXDSR3_DB4_MASK             16
#define CAN3RXDSR3_DB5_MASK             32
#define CAN3RXDSR3_DB6_MASK             64
#define CAN3RXDSR3_DB7_MASK             128


/*** CAN3RXDSR4 - MSCAN 3 Receive Data Segment Register 4; 0x00000228 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR4STR;
extern volatile CAN3RXDSR4STR _CAN3RXDSR4 @(REG_BASE + 0x00000228);
#define CAN3RXDSR4                      _CAN3RXDSR4.Byte
#define CAN3RXDSR4_DB0                  _CAN3RXDSR4.Bits.DB0
#define CAN3RXDSR4_DB1                  _CAN3RXDSR4.Bits.DB1
#define CAN3RXDSR4_DB2                  _CAN3RXDSR4.Bits.DB2
#define CAN3RXDSR4_DB3                  _CAN3RXDSR4.Bits.DB3
#define CAN3RXDSR4_DB4                  _CAN3RXDSR4.Bits.DB4
#define CAN3RXDSR4_DB5                  _CAN3RXDSR4.Bits.DB5
#define CAN3RXDSR4_DB6                  _CAN3RXDSR4.Bits.DB6
#define CAN3RXDSR4_DB7                  _CAN3RXDSR4.Bits.DB7

#define CAN3RXDSR4_DB0_MASK             1
#define CAN3RXDSR4_DB1_MASK             2
#define CAN3RXDSR4_DB2_MASK             4
#define CAN3RXDSR4_DB3_MASK             8
#define CAN3RXDSR4_DB4_MASK             16
#define CAN3RXDSR4_DB5_MASK             32
#define CAN3RXDSR4_DB6_MASK             64
#define CAN3RXDSR4_DB7_MASK             128


