parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
#define CAN3TXDSR1_DB0_MASK             1
#define CAN3TXDSR1_DB1_MASK             2
#define CAN3TXDSR1_DB2_MASK             4
#define CAN3TXDSR1_DB3_MASK             8
#define CAN3TXDSR1_DB4_MASK             16
#define CAN3TXDSR1_DB5_MASK             32
#define CAN3TXDSR1_DB6_MASK             64
#define CAN3TXDSR1_DB7_MASK             128


/*** CAN3TXDSR2 - MSCAN 3 Transmit Data Segment Register 2; 0x00000236 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR2STR;
extern volatile CAN3TXDSR2STR _CAN3TXDSR2 @(REG_BASE + 0x00000236);
#define CAN3TXDSR2                      _CAN3TXDSR2.Byte
#define CAN3TXDSR2_DB0                  _CAN3TXDSR2.Bits.DB0
#define CAN3TXDSR2_DB1                  _CAN3TXDSR2.Bits.DB1
#define CAN3TXDSR2_DB2                  _CAN3TXDSR2.Bits.DB2
#define CAN3TXDSR2_DB3                  _CAN3TXDSR2.Bits.DB3
#define CAN3TXDSR2_DB4                  _CAN3TXDSR2.Bits.DB4
#define CAN3TXDSR2_DB5                  _CAN3TXDSR2.Bits.DB5
#define CAN3TXDSR2_DB6                  _CAN3TXDSR2.Bits.DB6
#define CAN3TXDSR2_DB7                  _CAN3TXDSR2.Bits.DB7

#define CAN3TXDSR2_DB0_MASK             1
#define CAN3TXDSR2_DB1_MASK             2
#define CAN3TXDSR2_DB2_MASK             4
#define CAN3TXDSR2_DB3_MASK             8
#define CAN3TXDSR2_DB4_MASK             16
#define CAN3TXDSR2_DB5_MASK             32
#define CAN3TXDSR2_DB6_MASK             64
#define CAN3TXDSR2_DB7_MASK             128


/*** CAN3TXDSR3 - MSCAN 3 Transmit Data Segment Register 3; 0x00000237 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR3STR;
extern volatile CAN3TXDSR3STR _CAN3TXDSR3 @(REG_BASE + 0x00000237);
#define CAN3TXDSR3                      _CAN3TXDSR3.Byte
#define CAN3TXDSR3_DB0                  _CAN3TXDSR3.Bits.DB0
#define CAN3TXDSR3_DB1                  _CAN3TXDSR3.Bits.DB1
#define CAN3TXDSR3_DB2                  _CAN3TXDSR3.Bits.DB2
#define CAN3TXDSR3_DB3                  _CAN3TXDSR3.Bits.DB3
#define CAN3TXDSR3_DB4                  _CAN3TXDSR3.Bits.DB4
#define CAN3TXDSR3_DB5                  _CAN3TXDSR3.Bits.DB5
#define CAN3TXDSR3_DB6                  _CAN3TXDSR3.Bits.DB6
#define CAN3TXDSR3_DB7                  _CAN3TXDSR3.Bits.DB7

#define CAN3TXDSR3_DB0_MASK             1
#define CAN3TXDSR3_DB1_MASK             2
#define CAN3TXDSR3_DB2_MASK             4
#define CAN3TXDSR3_DB3_MASK             8
#define CAN3TXDSR3_DB4_MASK             16
#define CAN3TXDSR3_DB5_MASK             32
#define CAN3TXDSR3_DB6_MASK             64
#define CAN3TXDSR3_DB7_MASK             128


/*** CAN3TXDSR4 - MSCAN 3 Transmit Data Segment Register 4; 0x00000238 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR4STR;
extern volatile CAN3TXDSR4STR _CAN3TXDSR4 @(REG_BASE + 0x00000238);
#define CAN3TXDSR4                      _CAN3TXDSR4.Byte
#define CAN3TXDSR4_DB0                  _CAN3TXDSR4.Bits.DB0
#define CAN3TXDSR4_DB1                  _CAN3TXDSR4.Bits.DB1
#define CAN3TXDSR4_DB2                  _CAN3TXDSR4.Bits.DB2
#define CAN3TXDSR4_DB3                  _CAN3TXDSR4.Bits.DB3
#define CAN3TXDSR4_DB4                  _CAN3TXDSR4.Bits.DB4
#define CAN3TXDSR4_DB5                  _CAN3TXDSR4.Bits.DB5
#define CAN3TXDSR4_DB6                  _CAN3TXDSR4.Bits.DB6
#define CAN3TXDSR4_DB7                  _CAN3TXDSR4.Bits.DB7

#define CAN3TXDSR4_DB0_MASK             1
#define CAN3TXDSR4_DB1_MASK             2
#define CAN3TXDSR4_DB2_MASK             4
#define CAN3TXDSR4_DB3_MASK             8
#define CAN3TXDSR4_DB4_MASK             16
#define CAN3TXDSR4_DB5_MASK             32
#define CAN3TXDSR4_DB6_MASK             64
#define CAN3TXDSR4_DB7_MASK             128


/*** CAN3TXDSR5 - MSCAN 3 Transmit Data Segment Register 5; 0x00000239 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR5STR;
extern volatile CAN3TXDSR5STR _CAN3TXDSR5 @(REG_BASE + 0x00000239);
#define CAN3TXDSR5                      _CAN3TXDSR5.Byte
#define CAN3TXDSR5_DB0                  _CAN3TXDSR5.Bits.DB0
#define CAN3TXDSR5_DB1                  _CAN3TXDSR5.Bits.DB1
#define CAN3TXDSR5_DB2                  _CAN3TXDSR5.Bits.DB2
#define CAN3TXDSR5_DB3                  _CAN3TXDSR5.Bits.DB3
#define CAN3TXDSR5_DB4                  _CAN3TXDSR5.Bits.DB4
#define CAN3TXDSR5_DB5                  _CAN3TXDSR5.Bits.DB5
#define CAN3TXDSR5_DB6                  _CAN3TXDSR5.Bits.DB6
#define CAN3TXDSR5_DB7                  _CAN3TXDSR5.Bits.DB7

#define CAN3TXDSR5_DB0_MASK             1
#define CAN3TXDSR5_DB1_MASK             2
#define CAN3TXDSR5_DB2_MASK             4
#define CAN3TXDSR5_DB3_MASK             8
#define CAN3TXDSR5_DB4_MASK             16
#define CAN3TXDSR5_DB5_MASK             32
#define CAN3TXDSR5_DB6_MASK             64
#define CAN3TXDSR5_DB7_MASK             128


/*** CAN3TXDSR6 - MSCAN 3 Transmit Data Segment Register 6; 0x0000023A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR6STR;
extern volatile CAN3TXDSR6STR _CAN3TXDSR6 @(REG_BASE + 0x0000023A);
#define CAN3TXDSR6                      _CAN3TXDSR6.Byte
#define CAN3TXDSR6_DB0                  _CAN3TXDSR6.Bits.DB0
#define CAN3TXDSR6_DB1                  _CAN3TXDSR6.Bits.DB1
#define CAN3TXDSR6_DB2                  _CAN3TXDSR6.Bits.DB2
#define CAN3TXDSR6_DB3                  _CAN3TXDSR6.Bits.DB3
#define CAN3TXDSR6_DB4                  _CAN3TXDSR6.Bits.DB4
#define CAN3TXDSR6_DB5                  _CAN3TXDSR6.Bits.DB5
#define CAN3TXDSR6_DB6                  _CAN3TXDSR6.Bits.DB6
#define CAN3TXDSR6_DB7                  _CAN3TXDSR6.Bits.DB7

#define CAN3TXDSR6_DB0_MASK             1
#define CAN3TXDSR6_DB1_MASK             2
#define CAN3TXDSR6_DB2_MASK             4
#define CAN3TXDSR6_DB3_MASK             8
#define CAN3TXDSR6_DB4_MASK             16
#define CAN3TXDSR6_DB5_MASK             32
#define CAN3TXDSR6_DB6_MASK             64
#define CAN3TXDSR6_DB7_MASK             128


/*** CAN3TXDSR7 - MSCAN 3 Transmit Data Segment Register 7; 0x0000023B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR7STR;
extern volatile CAN3TXDSR7STR _CAN3TXDSR7 @(REG_BASE + 0x0000023B);
#define CAN3TXDSR7                      _CAN3TXDSR7.Byte
#define CAN3TXDSR7_DB0                  _CAN3TXDSR7.Bits.DB0
#define CAN3TXDSR7_DB1                  _CAN3TXDSR7.Bits.DB1
#define CAN3TXDSR7_DB2                  _CAN3TXDSR7.Bits.DB2
#define CAN3TXDSR7_DB3                  _CAN3TXDSR7.Bits.DB3
#define CAN3TXDSR7_DB4                  _CAN3TXDSR7.Bits.DB4
#define CAN3TXDSR7_DB5                  _CAN3TXDSR7.Bits.DB5
#define CAN3TXDSR7_DB6                  _CAN3TXDSR7.Bits.DB6
#define CAN3TXDSR7_DB7                  _CAN3TXDSR7.Bits.DB7

