parai/GaInOS_Based_On_uTenux-tkernel/gainos/uTenux/bin/app_mc9s12/chip_mc9s12dp512/Sources/mc9s12dp512.h
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x0000FF0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x0000FF0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_NV2                      _NVFSEC.Bits.NV2
#define NVFSEC_NV3                      _NVFSEC.Bits.NV3
#define NVFSEC_NV4                      _NVFSEC.Bits.NV4
#define NVFSEC_NV5                      _NVFSEC.Bits.NV5
#define NVFSEC_NV6                      _NVFSEC.Bits.NV6
#define NVFSEC_KEYEN                    _NVFSEC.Bits.KEYEN
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_NV_2                     _NVFSEC.MergedBits.grpNV_2
#define NVFSEC_NV                       NVFSEC_NV_2

#define NVFSEC_SEC0_MASK                1
#define NVFSEC_SEC1_MASK                2
#define NVFSEC_NV2_MASK                 4
#define NVFSEC_NV3_MASK                 8
#define NVFSEC_NV4_MASK                 16
#define NVFSEC_NV5_MASK                 32
#define NVFSEC_NV6_MASK                 64
#define NVFSEC_KEYEN_MASK               128
#define NVFSEC_SEC_MASK                 3
#define NVFSEC_SEC_BITNUM               0
#define NVFSEC_NV_2_MASK                124
#define NVFSEC_NV_2_BITNUM              2


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(ARMCOP = 0x55, ARMCOP = 0xAA)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */
#define MCCNTlo_BIT0                     This_symb_has_been_depreciated
#define MCCNTlo_BIT1                     This_symb_has_been_depreciated
#define MCCNTlo_BIT2                     This_symb_has_been_depreciated
#define MCCNTlo_BIT3                     This_symb_has_been_depreciated
#define MCCNTlo_BIT4                     This_symb_has_been_depreciated
#define MCCNTlo_BIT5                     This_symb_has_been_depreciated
#define MCCNTlo_BIT6                     This_symb_has_been_depreciated
#define MCCNTlo_BIT7                     This_symb_has_been_depreciated
#define MCCNThi_BIT8                     This_symb_has_been_depreciated
#define MCCNThi_BIT9                     This_symb_has_been_depreciated
#define MCCNThi_BIT10                    This_symb_has_been_depreciated
#define MCCNThi_BIT11                    This_symb_has_been_depreciated
#define MCCNThi_BIT12                    This_symb_has_been_depreciated
#define MCCNThi_BIT13                    This_symb_has_been_depreciated
#define MCCNThi_BIT14                    This_symb_has_been_depreciated
#define MCCNThi_BIT15                    This_symb_has_been_depreciated
#define MCCNTlo_BIT0_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT1_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT2_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT3_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT4_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT5_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT6_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT7_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT8_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT9_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT10_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT11_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT12_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT13_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT14_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT15_MASK               This_symb_has_been_depreciated


#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif

#endif
